LEXICON_DATA: dict[str, str] = {
    'start': 'Вас приветствует бот Приемной комиссии ГПОУ ЯО Ярославского колледжа индустрии питания. Здесь Вы сможете ознакомиться с основной информацией о приеме на текущий учебный год и узнать ответы на часто задаваемые вопросы.',
    'start-view': 'Уважаемые поступающие! Опубликованы Правила приема абитуриентов текущего учебного года. Подробнее на сайте Приемной комиссии ЯрКИП (https://yar-kip.edu.yar.ru/abiturientam/abiturientam.html) или по кнопке ниже.',
    'admission-view': 'Информация для поступающих после 9-11 класса, колледжей и техникумов:',
    'destination-list-view': 'В соответствии с Правилами приема Вы можете подать документы не более чем на 5 направлений подготовки (специальностей/профессий). В пределах одной конкурсной группы допускается подача документов одновременно на бюджетное и договорное обучение по очной, очно-заочной и заочной формам обучения.',
}

LEXICON_COMMANDS: dict[str, str] = {
    '/home': 'В начало',
    '/help': 'Помощь',
}

LEXICON_BUTTONS: dict[str, str] = {
    # 1. Главный экран
    'start-admission': 'Информация о приёме в текущем году',
    'start-translate': 'Перевод из другого учреждения в ЯрКИП',
    'faq': 'FAQ',
    # 1.1. Информация о приёме в текущем году
    'admission-rulle': 'Правила приёма',
    'destinations-list': 'Список специальностей и профессий',
    'admission-dates': 'Сроки приёма',
    'document-submission': 'Способы подачи документов',
    'dormitory': 'Общежитие',
    'special-rights': 'Особые права',
    # 1.3. FAQ
    'admission-documents-rulle': 'Как подать документы?',
    'study-duration': 'Сколько лет проходит обучение?',
    'budget-places': 'Имеются ли бюджетные места?',
    'admissions-count': 'На сколько направлений я могу подавать документы?',
    'stipend': 'Как получать стипендию?',
    # 1.1.2. Список специальностей и профессий
    'mci': 'Мастер по обработке цифровой информации',
    'cook': 'Повар, кондитер (СПО)',
    'cookery': 'Поварское и кондитерское дело',
    'sys': 'Сетевое и системное администрированние',
    'bread-technology': 'Технология хлеба, макаронных и кондитерских изделий',
    'economy': 'Экономика и бухгалтерский учет',
    'admission-documents': 'Необходимые документы',
    # Общеие
    'back': 'Назад'
}
